# Taps
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask 'appcleaner'
cask 'cheatsheet'
cask 'copyclip'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'gimp'
cask 'hiddenbar'
cask 'iina'
cask 'iterm2'
cask 'latest'
cask 'linearmouse'
cask 'megasync'
cask 'notion'
cask 'pycharm-ce'
cask 'raycast'
cask 'rectangle'
cask 'spotify'
cask 'telegram-desktop'
cask 'tempbox'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'
cask 'zoxide'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-hack-nerd-font'
cask 'font-ia-writer-mono'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'AusweisApp Bund', id: 948660805
mas 'Proton Pass - Password Manager', id: 6443490629
mas 'Pure Paste', id: 1611378436
mas 'HotKey App', id: 975890633
mas 'Velja', id: 1607635845
mas 'Xnip - Screenshot & Annotation', id: 1221250572